src/Documents/ВыездСПарковки/ВыездСПарковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыездСПарковки</name>
  <registerRecords>AccumulationRegister.ЗанятостьМест</registerRecords>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплата</name>
    <type>
      <types>DocumentRef.ОплатаМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСтоянки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ВыездСПарковки/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Площадка") Тогда
		Объект.Площадка = Параметры.Площадка;
	КонецЕсли;
	
	Если Параметры.Свойство("Место") Тогда
		Объект.Место = Параметры.Место;
	КонецЕсли;
	
	Если Параметры.Свойство("Ряд") Тогда
		Объект.Ряд = Параметры.Ряд;
	КонецЕсли;
	
	Дата = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	
	Если Объект.Место.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоМестуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоМестуНаСервере()
	
	МестоОбъект = Объект.Место.ПолучитьОбъект();
	
	Объект.Площадка = МестоОбъект.Площадка;
	Объект.Ряд = Объект.Место.Владелец;
	
	Если Не Объект.Площадка.Пустая() Тогда
		
		ПлощадкаОбъект = Объект.Площадка.ПолучитьОбъект();
		
		Если Не ПлощадкаОбъект.Владелец.Пустая() Тогда
			Объект.Территория = ПлощадкаОбъект.Владелец;
			
			ТерриторияОбъект = ПлощадкаОбъект.Владелец.ПолучитьОбъект();
			
			Если Не ТерриторияОбъект.Владелец.Пустая() Тогда
				Объект.Организация = ТерриторияОбъект.Владелец;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
